# AssemblyDifference Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyDifference Class
Members See Also
---
Class that describes difference between two assemblies.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class AssemblyDifference : IDisposable
```

Visual Basic
---
```text
Public Class AssemblyDifference _
	Implements IDisposable
```

Visual C++
---
```text
public ref class AssemblyDifference : IDisposable
```

# Remarks
The assembly comparison function returns a sub-class of this class. Different sub-classes represent different kinds of differences and contain additional data for each particular kind of difference.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..AssemblyDifference Autodesk.Revit.DB..::..AssemblyDifferenceConfiguration Autodesk.Revit.DB..::..AssemblyDifferenceMemberCount Autodesk.Revit.DB..::..AssemblyDifferenceMemberDifference Autodesk.Revit.DB..::..AssemblyDifferenceNamingCategory Autodesk.Revit.DB..::..AssemblyDifferenceNone
# See Also
AssemblyDifference Members
Autodesk.Revit.DB Namespace